#include "basics.h"
#include <iostream>

void basics() {
    std::cout << "OOP Basics" << std::endl;
}

/* Основні принципи ООП.
Абстрагування, спадкування, поліморфізм, інкапсуляція.
Абстракція – термін, що означає поєднання деякої множини сутностей.
Приклад – природна мова. Майже будь-яке слово значить множину.
"Телефон" – величезна множина реальних речей (сутностей).
Машинним мовам абстракція не властива, інструкції мають чітке вираження.
Абстрагування – побудова мовних конструкцій, здатних поєднувати множинні властивості (сутності та інші абстракції).
*/